# Used by the brew_install() function.

# CLIs
# ---
brew 'git'
brew 'node'
brew 'yarn'
brew 'rsync'
brew 'ffmpeg'
brew 'imagemagick'
brew 'trash'
brew 'rename'
brew 'exiftool'
brew 'aspell'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'pngquant' # for compressing PNG files
brew 'zopfli' # for compressing PNG files
brew 'mas' # required to install Mac App Store apps
brew 'eye-d3' # for editing ID 3 metadata on MP3 files
# https://github.com/Homebrew/homebrew-bundle#requirements

# Apps
# ---
cask 'iterm2'
cask 'visual-studio-code'
cask 'brave-browser'
cask 'imageoptim'
cask 'appcleaner'
cask 'dropbox'
cask 'transmission'
cask 'vlc'
cask 'handbrake'
cask 'nordvpn'
cask 'coconutbattery'
cask 'miniconda'
cask 'zotero'
cask 'transmit'
cask 'daisydisk'
cask 'keka'
cask 'clipy'
cask 'losslesscut'
cask 'telegram'
# QuickLook plugins
cask 'provisionql'
cask 'webpquicklook'
cask 'qlvideo'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'quicklook-json'

# Mac App Store
# ---
mas 'Magnet', id: 441258766
mas 'Final Cut Pro', id: 424389933
mas 'Keynote', id: 409183694
mas 'MoneyMoney', id: 872698314
mas 'Slack', id: 803453959
mas 'Affinity Designer', id: 824171161
mas '1Password', id: 443987910
mas 'Gemini', id: 463541543
mas 'PDFScanner', id: 410968114
mas 'Pages', id: 409201541
mas 'Yoink', id: 457622435
mas 'Numbers', id: 409203825
