# Used by the brew_install() function.

# CLIs
brew "blueutil" # https://apple.stackexchange.com/a/47508
brew "ffmpeg"
brew "gh"
brew "git"
brew "python"
brew "imagemagick"
brew "mas" # required to install Mac App Store apps below
brew "netlify-cli"
brew "node"
brew "pngquant"
brew "pre-commit"
brew "rename"
brew "rsync"
brew "shellcheck"
brew "trash"
brew "yarn"
brew "zopfli"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Apps
cask "appcleaner"
cask "brave-browser"
cask "clipy"
cask "coconutbattery"
cask "daisydisk"
cask "dropbox"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "mylio"
cask "nordvpn"
cask "slack"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zotero"

# Mac App Store
mas "1Password", id: 443987910
mas "Affinity Designer", id: 824171161
mas "Final Cut Pro", id: 424389933
mas "Gemini", id: 463541543
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "MoneyMoney", id: 872698314
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFScanner", id: 410968114
mas "Yoink", id: 457622435
